src/src/Documents/ExpenditureRequest.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ExpenditureRequest</Name>
			<BasedOn>
				<xr:Item>Document.PurchaseOrder</xr:Item>
				<xr:Item>Document.SupplierInvoice</xr:Item>
				<xr:Item>Document.ExpenseReport</xr:Item>
				<xr:Item>Document.AccountSalesToConsignor</xr:Item>
				<xr:Item>Document.PayrollSheet</xr:Item>
				<xr:Item>Document.SubcontractorReport</xr:Item>
				<xr:Item>Document.AdditionalExpenses</xr:Item>
				<xr:Item>Document.SupplierQuote</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.PaymentCalendar</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashFlowItem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashFlowItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashAssetsType</Name>
					<Comment>Cash assets kind</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.CashAssetTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PettyCash</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BasisDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.ExpenseReport</v8:Type>
						<v8:Type>cfg:DocumentRef.SubcontractorReport</v8:Type>
						<v8:Type>cfg:DocumentRef.AccountSalesToConsignor</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierQuote</v8:Type>
						<v8:Type>cfg:DocumentRef.AdditionalExpenses</v8:Type>
						<v8:Type>cfg:DocumentRef.PayrollSheet</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentConfirmationStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PaymentApprovalStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingDocumentNumber</Name>
					<Comment>Incoming document No.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingDocumentDate</Name>
					<Comment>Date of incoming document</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/src/Enums/CashAssetTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>CashAssetTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Cash</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Noncash</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/PaymentApprovalStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>PaymentApprovalStatuses</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Approved</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotApproved</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Documents/ExpenditureRequest/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

// Payment calendar table formation procedure.
//
// Parameters:
// DocumentRef - DocumentRef.CashInflowForecast - Current
// document AdditionalProperties - AdditionalProperties - Additional properties of the document
//
Procedure GenerateTablePaymentCalendar(DocumentRef, StructureAdditionalProperties)
	
	Query = New Query;
	
	Query.SetParameter("Ref", DocumentRef);
	Query.SetParameter("Company", StructureAdditionalProperties.ForPosting.Company);
	
	Query.Text =
	"SELECT
	|	DocumentTable.Date AS Period,
	|	&Company AS Company,
	|	DocumentTable.CashFlowItem AS Item,
	|	DocumentTable.CashAssetsType AS CashAssetsType,
	|	DocumentTable.PaymentConfirmationStatus AS PaymentConfirmationStatus,
	|	CASE
	|		WHEN DocumentTable.CashAssetsType = VALUE(Enum.CashAssetTypes.Cash)
	|			THEN DocumentTable.PettyCash
	|		WHEN DocumentTable.CashAssetsType = VALUE(Enum.CashAssetTypes.Noncash)
	|			THEN DocumentTable.BankAccount
	|		ELSE UNDEFINED
	|	END AS BankAccountPettyCash,
	|	&Ref AS Quote,
	|	DocumentTable.DocumentCurrency AS Currency,
	|	-DocumentTable.DocumentAmount AS Amount
	|FROM
	|	Document.ExpenditureRequest AS DocumentTable
	|WHERE
	|	DocumentTable.Ref = &Ref";
	
	QueryResult = Query.Execute();
	
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TablePaymentCalendar", QueryResult.Unload());
	
EndProcedure

// Creates a document data table.
//
// Parameters:
// DocumentRef - DocumentRef.CashInflowForecast - Current
// document StructureAdditionalProperties - AdditionalProperties - Additional properties of the document
//	
Procedure InitializeDocumentData(DocumentRef, StructureAdditionalProperties) Export
	
	GenerateTablePaymentCalendar(DocumentRef, StructureAdditionalProperties);
	
EndProcedure

#Region PrintInterface

// Procedure forms and displays a printable document form by the specified layout.
//
// Parameters:
// SpreadsheetDocument - TabularDocument in which
// 			   printing form will be displayed.
//  TemplateName    - String, printing form layout name.
//
Procedure GenerateExpenditureRequestning(SpreadsheetDocument, ObjectsArray, PrintObjects)
	
	FirstDocument = True;
	SpreadsheetDocument.PrintParametersName = "PARAMETERS_PRINT_ExpenditureRequest_ExpenditureRequestning";
	Template = PrintManagement.PrintedFormsTemplate("Document.ExpenditureRequest.PF_MXL_ExpenditureRequestning");
	
	FillStructureSection = New Structure;
	For Each CurrentDocument In ObjectsArray Do
		
		If Not FirstDocument Then
			
			SpreadsheetDocument.PutHorizontalPageBreak();
			
		EndIf;
		
		FirstDocument = False;
		FirstLineNumber = SpreadsheetDocument.TableHeight + 1;
		
		Query = New Query;
		Query.Text = 
		"SELECT
		|	CAOutflowPlan.Ref,
		|	CAOutflowPlan.Number AS Number,
		|	CAOutflowPlan.Date AS DocumentDate,
		|	CAOutflowPlan.Company AS Company,
		|	CAOutflowPlan.Company.Prefix AS Prefix,
		|	CAOutflowPlan.DocumentAmount AS Amount,
		|	CAOutflowPlan.DocumentCurrency AS Currency,
		|	PRESENTATION(CAOutflowPlan.CashFlowItem) AS CFItem,
		|	CAST(CAOutflowPlan.Comment AS String(1000)) AS Comment,
		|	CAOutflowPlan.CashAssetsType AS CAType,
		|	CAOutflowPlan.BankAccount.Code AS BANumber,
		|	CAOutflowPlan.PettyCash AS PettyCash,
		|	PRESENTATION(CAOutflowPlan.BasisDocument) AS DescriptionBases,
		|	CASE 
		|		WHEN CAOutflowPlan.Posted AND CAOutflowPlan.PaymentConfirmationStatus = Value(Enum.PaymentApprovalStatuses.Approved) THEN True
		|		ELSE False
		|	END AS ApplicationApproved,
		|	CAOutflowPlan.IncomingDocumentNumber,
		|	CAOutflowPlan.IncomingDocumentDate,
		|	CAOutflowPlan.Counterparty AS Counterparty,
		|	CAOutflowPlan.Contract AS Contract,
		|	CAOutflowPlan.Author
		|FROM
		|	Document.ExpenditureRequest AS CAOutflowPlan
		|WHERE
		|	CAOutflowPlan.Ref = &CurrentDocument";
		Query.SetParameter("CurrentDocument", CurrentDocument);
		DocumentData = Query.Execute().Select();
		DocumentData.Next();
		
		// :::Approved, indent
		TemplateArea = Template.GetArea(?(DocumentData.ApplicationApproved, "Approved", "Indent"));
		SpreadsheetDocument.Put(TemplateArea);
		
		// :::Header
		TemplateArea = Template.GetArea("Header");
		FillStructureSection.Clear();
		
		DocumentNumber = DriveServer.GetNumberForPrintingConsideringDocumentDate(DocumentData.DocumentDate, DocumentData.Number, DocumentData.Prefix);
		DocumentDate = Format(DocumentData.DocumentDate, "DLF=D");
		Title = StringFunctionsClientServer.SubstituteParametersInString(
			NStr("en = 'Planning of the cash assets outflow #%1, %2'"),
			DocumentNumber,
			DocumentDate);
		FillStructureSection.Insert("Title", Title);
		TemplateArea.Parameters.Fill(FillStructureSection);
		SpreadsheetDocument.Put(TemplateArea);
		
		// :::String
		TemplateArea = Template.GetArea("String");
		FillStructureSection.Clear();
		
		FillStructureSection.Insert("CFItem", DocumentData.CFItem);
		FillStructureSection.Insert("Comment", DocumentData.Comment);
		FillStructureSection.Insert("DescriptionAmount", Format(DocumentData.Amount, "ND=15; NFD=2; NDS=.") + ", " + DocumentData.Currency);
		
		TemplateArea.Parameters.Fill(FillStructureSection);
		SpreadsheetDocument.Put(TemplateArea);
		
		// :::Footer
		TemplateArea = Template.GetArea("Footer");
		FillStructureSection.Clear();
		
		FillStructureSection.Insert("AmountInWords", WorkWithExchangeRates.GenerateAmountInWords(DocumentData.Amount, DocumentData.Currency));
		FillStructureSection.Insert("DescriptionBases", DocumentData.DescriptionBases);
		FillStructureSection.Insert("CounterpartyDescription", DocumentData.Counterparty);
		
		FundingSourceDescription = "";
		If DocumentData.CAType = Enums.CashAssetTypes.Noncash Then
			
			FundingSourceDescription = NStr("en = 'company settlement account #'") + DocumentData.BANumber;
			
		ElsIf DocumentData.CAType = Enums.CashAssetTypes.Noncash Then
			
			FundingSourceDescription = NStr("en = 'Organisation''s cash'") + " " + DocumentData.PettyCash;
			
		EndIf;
		FillStructureSection.Insert("FundingSourceDescription", FundingSourceDescription);
		
		TemplateArea.Parameters.Fill(FillStructureSection);
		SpreadsheetDocument.Put(TemplateArea);
		
		// :::Signature
		TemplateArea = Template.GetArea("Signature");
		FillStructureSection.Clear();
		
		ResponsiblePersons = DriveServer.OrganizationalUnitsResponsiblePersons(DocumentData.Company, DocumentData.DocumentDate);
		FillStructureSection.Insert("HeadPosition", ResponsiblePersons.HeadPosition);
		FillStructureSection.Insert("ChiefAccountantPosition", ResponsiblePersons.ChiefAccountantPosition);
		FillStructureSection.Insert("HeadNameAndSurname", ResponsiblePersons.HeadDescriptionFull);
		FillStructureSection.Insert("ChiefAccountantNameAndSurname", ResponsiblePersons.ChiefAccountantNameAndSurname);
		
		TemplateArea.Parameters.Fill(FillStructureSection);
		SpreadsheetDocument.Put(TemplateArea);
		
		PrintManagement.SetDocumentPrintArea(SpreadsheetDocument, FirstLineNumber, PrintObjects, CurrentDocument.Ref);
		
	EndDo;
	
	SpreadsheetDocument.FitToPage = True;
	
EndProcedure

// Generate printed forms of objects
//
// Incoming:
//   TemplateNames    - String    - Names of layouts separated
//   by commas ObjectsArray  - Array    - Array of refs to objects that
//   need to be printed PrintParameters - Structure - Structure of additional printing parameters
//
// Outgoing:
//   PrintFormsCollection - Values table - Generated
//   table documents OutputParameters       - Structure        - Parameters of generated table documents
//
Procedure Print(ObjectsArray, PrintParameters, PrintFormsCollection, PrintObjects, OutputParameters) Export
	
	SpreadsheetDocument = New SpreadsheetDocument;
	If PrintManagement.NeedToPrintTemplate(PrintFormsCollection, "ExpenditureRequestning") Then
		
		GenerateExpenditureRequestning(SpreadsheetDocument, ObjectsArray, PrintObjects);
		PrintManagement.OutputSpreadsheetDocumentToCollection(PrintFormsCollection, "ExpenditureRequestning", "Cash outflow planning", SpreadsheetDocument);
		
	EndIf;
	
	// parameters of sending printing forms by email
	DriveServer.FillSendingParameters(OutputParameters.SendingParameters, ObjectsArray, PrintFormsCollection);

EndProcedure

// Fills in the list of printing commands.
// 
// Parameters:
//   PrintCommands - ValueTable - see fields' content in the PrintManagement.CreatePrintCommandsCollection function.
//
Procedure AddPrintCommands(PrintCommands) Export
	
	PrintCommand = PrintCommands.Add();
	PrintCommand.ID = "ExpenditureRequestning";
	PrintCommand.Presentation = NStr("en = 'Cash expense planning'");
	PrintCommand.FormsList = "DocumentForm,ListForm";
	PrintCommand.CheckPostingBeforePrint = False;
	PrintCommand.Order = 1;
	
EndProcedure

#EndRegion

#EndIf
